---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSettings.GetConduitSettings(Autodesk.Revit.DB.Document)
source: html/90f7dec1-5c06-1411-098f-a5e076be5406.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSettings.GetConduitSettings Method

Gets the conduit settings of the project.

## Syntax (C#)
```csharp
public static ConduitSettings GetConduitSettings(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The conduit settings of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null